package kosta.mission;

import java.util.Scanner;

public class HomeStudy04 {

	public static void main(String[] args) {
	
		// 핵심 예제  미션
		//1
		// 이름,나이,주소를 변수에 초기화 후 콘솔에 출력하자
		// 변수선언 주의사항
		// 변수명은 특수문자 x, 숫자로 x, 소문자 사용, _ 가능
		
		
		//2
		// 성적관리 프로그램 구현하자
		// 국어, 영어 , 수학 성적을 입력 받은 후 
		// 총점과 평균을 출력해보자.
		//키보드로부터 점수 입력 받기/
		
		
		//3
		// 임의의 정수 값에 대해서 전체 자리수 중 짝수, 홀수의 개수를 구하자
				//ex 5자리 수 ex)12345
				//짝수 개수 : 3개
				//홀수 개수 : 2개
		
		
		
		//4. 로그인 예제를 구현해 보자
		//id , pass 키보드로부터 입력
		//id, pass 모두 일치하면 => 로그인 성공
		//id 불일치 => 해당아이디가 존재하지 않습니다.
		//pass가 불일치 => 비밀번호가 일치하지 않습니다.
		
		//5. 메뉴를 선택해서 해당 메뉴의 명령문을 실행해보자
		// 1. 추가 2. 출력 3.검색 4. 종료
		// 계속 메뉴 선택이 가능하고 4번을 선택했을때만 종료 return;
		
		
		
		//6
		//updown 게임
		//임의의 난수를 생성 : 1~100 사이 > 정답
		// 키보드로부터 정소를 입력 (1~100) > 이외의 값일 경우 validation check
		//정답과 숫자를 비교해서
		// 정답 : 축하합니다., 몇번만에 성공,
		// 오답 : Up 더 크면 , Down 작으면 출력
		
		//7
		/*
		 * [갤러그 문제]
		 * 
		 * 고전게임을 잘하기로 소문난 두 형제 종현이와 종원이는 요새 갤러그라는 게임에 푹 빠져 있다. 현재 종현이와 종원이의 점수는 각각 A점과
		 * B점이고, 종현이의 점수는 A는 종원이의 점수 B보다 높거나 같다. 종현이는 매일 점수가 2배씩 상승하지만, 노력파인 종원이는 종현이를
		 * 이기기 위해 쉬지 않고 연습한 결과 매일 점수가 3배씩 상승하는 능력을 갖추었다. 이때 며칠이 지나야 종원이가 종현이의 점수보다 높아질 수
		 * 있을까?
		 * 
		 * [입력] 첫 번째 줄에 테스트케이스의 수 T(1<= T<=50)가 주어진다. 각 테스트케이스마다 최초 종현이의 점수 A와 종원이의 점수
		 * B가 각각 공백을 두고 주어진다. 단 최초 종현이의 점수 A는 종원이의 점수 B보다 크거나 같으면 1점 이상 5천점 이하의 점수이다.
		 * (A>=B, 1<=B<=5000)
		 * 
		 * [출력] 각 줄마다 "#T"(T는 테스트케이스 번호)를 출력한 뒤, 종원이의 점수가 종현이의 점수를 추월하게 되는데 필요한 일수를
		 * 출력한다.
		 * 
		 * [sample input] 게임 횟수 - 3 종원이 / 종현이 7 / 1 8 / 3 4 / 4
		 * 
		 * [sample output] #1 5 #2 3 #3 1
		 * 
		 */
		
		
		
		//8 
		
		
		
		
		
		
		
		
		

	}

}
